# Домашнее задание №2. Pandas

### Общие Правила выполнения дз:
* У функции нельзя менять название, иначе тесты не будут проходить.
* Можно делать дополнительные функции как внутри исходной функции, так и вне нее. Но ее также придется отправить.
* Можно бользоваться сокращениями `np`, `pd`, `sc` для стандартных библиотек.
* Нельзя ничего считывать с диска, если в коде функции присутствуют `open` и др. функции чтения или записи - задача не засчитывается.

## В этой домашке также запрещается использовать циклы for и while

In [2]:
import numpy as np
import pandas as pd

## (2 балл) Задание №1. Бухгалтерия зоопарка.

Вам на вход подается словарь, где ключ - это тип животного, а значение - словарь с признаками этого животного, где ключ - тип признака, а значение - значение признака. 

Вам следует создать табличку, где по строчкам будут идти животные, а по колонкам - их признаки, которая удовлетворяет следующим условиям
* Тип животного нужно выделить в отдельную колонку `Type`
* Строки отсортированы по типу животного в алфавитном порядке
* Колонки отсортированы в алфавитном порядке, кроме колонки `Type` - она первая
* Индексы строк - ряд натуральных чисел начиная с 0 без пропусков.

Имейте в виду, что признаки у двух животных могут не совпадать, значит незаполненные данные нужно заполнить Nan значением.

Верните на выходе **2** таблички(`DataFrame`): 
1. В которой присутствуют все признаки и все животные.
2. В которой отсутствуют Nan значения, но при этом могут отсутствовать некоторые признаки (животные должны присутствовать все). Если табличка будет пустой - возвращайте пустую табличку.

### Sample 1
#### Input:
```python
ZOO = {
        'cat':{'color':'black', 'tail_len': 50, 'injured': False}, 
        'dog':{'age': 6, 'tail_len': 30.5, 'injured': True}
      }
```
#### Output:
```python
table1 = 
  Type  age  color  tail_len  injured
0  cat  NaN  black      50.0    False
1  dog  6.0    NaN      35.5     True

tabel2 = 
  Type  tail_len  injured
0  cat      50.0    False
1  dog      35.5     True
```

In [4]:
def ZOOTable(zoo: dict) -> (pd.DataFrame, pd.DataFrame) :
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

### А сейчас пойдут задачки с самым легендарным датасетом для изучения МЛ - Titanic. В нем записи пассажиров титаника и их некоторые признаки.

#### На вход каждой следующей задачи поступает на вход неизмененный ДатаФрейм титаника. Чтобы посмотреть на него, можете загрузить его с помощью команды:

In [8]:
data = pd.read_csv('data/titanic_train.csv', index_col='PassengerId')

In [10]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## (1 балл) Задание №2.

Верните среднее, медиану, максимальное и минимальное значение возраста мужчин. Именно в данном порядке.

In [16]:
def men_stat(df: pd.DataFrame) -> (float, float, float, float):
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## (1 балл) Задание №3.

Узнаем правда ли, что женщины выживали чаще мужчин? Верните доли выживших женщин и мужчин в обеих группах? Порядок: женщины, мужчины.

In [16]:
def live_stat(df: pd.DataFrame) -> (float, float):
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## (2 балл) Задание №4.

Выведите список имен женщин отсортированный по популярности. 
* Если в строке присутствует слово `Miss.`, то имя - первое слово после `Miss`.
* Если в строке присутствует слово `Mrs.`, то имя - первое слово после `(`.
* Остальные строки не рассматриваем.
* Одинаковые имена сортируются по алфавиту.

In [17]:
def fename_stat(df: pd.DataFrame) -> pd.Series:
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## (1 балл) Задание №5.

Сделать сводную таблицу по **среднему возрасту** для пола и класса. Для примера посмотрите сводную таблицу по сумме выживших, для пола и класса. 
```Python
               Survived
Sex    Pclass          
female 1             91
       2             70
       3             72
male   1             45
       2             17
       3             47

```

In [54]:
def age_stat(df: pd.DataFrame) -> pd.DataFrame:
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## *(2 балл) Задание №6.

Вывести таблицу с кабинами, в которых живут более одного человека и столбец листов с именами этих пассажиров. 
В таблице должно присутствовать 2 столбца: `Cabin` и `Passengers`. Строки отсортированы по `Cabin` в алфавитном порядке. Элементы в листе могут быть в любом порядке.

In [3]:
def big_cabins(df: pd.DataFrame) -> pd.DataFrame:
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## (1 балл) Задание №7.

С помощью метода apply оставте в колонке `Name` только фамилию написанную полностью в верхнем регистре в **одну строчку**.

In [ ]:
def simple_name(df: pd.DataFrame) -> pd.DataFrame:
    ### ╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ
    pass

## Источники материалов:
* [mlcourse.ai](https://github.com/Yorko/mlcourse.ai) - курс Машинного обучения с OpenDataScience
* [AI Seminars](https://github.com/AICommunityInno/Seminars) - семинары по Машинному обучению в Иннополисе
* [HSE-ML course](https://github.com/esokolov/ml-course-hse) - курс Машинного обучения ФКН ВШЭ